message_me/app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "this is a test message"], ["user_id", 1], ["created_at", "2021-07-10 19:02:28.294287"], ["updated_at", "2021-07-10 19:02:28.294287"]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save