alpha-blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?)  [["title", "this is flash article"], ["created_at", "2021-07-03 07:19:43.032119"], ["updated_at", "2021-07-03 07:19:43.032119"], ["description", "show the falsh for this"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "aaaa"], ["updated_at", "2021-07-03 06:21:33.733802"], ["id", 5]]
---
  def update
    if @article.update(article_params)