alpha-blog/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "tarun98"], ["updated_at", "2021-07-04 09:20:06.884067"], ["id", 3]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def destroy
    @user = User.find(params[:id])